/**
 * 在C++中，`::`被称为作用域运算符，它有以下几种主要用途：

1. **访问全局变量**：当存在具有相同名称的局部变量时，
我们可以使用`::`来访问全局变量。
例如，如果我们有一个全局变量`int x;`和一个局部变量`int x;`，
我们可以使用`::x`来访问全局变量`x`¹。

2. **指明成员函数所属的类**：`::`可以用来指明一个成员函数属于哪个类。
例如，`M::f(s)`表示`f(s)`是类`M`的成员函数¹。

3. **在类的外部引用静态成员函数或定义成员函数,
也可以用来访问类或结构体的静态成员变量**：
如果我们想在类的外部引用静态成员函数，或在类的外部定义成员函数，
我们需要使用`::`。
例如，如果我们声明了一个类`A`，类`A`里声明了一个成员函数`void f()`，
但没有在类的声明里给出`f`的定义，那么在类外定义`f`时，就要写成`void A::f()`，表示这个`f()`函数是类`A`的成员函数¹。

4. **使用命名空间里的类型或函数**：我们可以使用`::`来引用命名空间中的类型或函数。例如，我们可以使用`std::cout`，`std::cin`，`std::string`等来引用`std`命名空间中的`cout`，`cin`和`string`¹。

 * 
 * 
 * 
*/